//
//  RegexPattern.swift
//  Foundation
//
//  Created by 이현재 on 10/16/25.
//

import Foundation

public enum RegexPattern: String {
    /// 이메일
    /// - AOS 내장 정규식 배낌
    case email = #"^[a-zA-Z0-9._%+-]{1,256}@[a-zA-Z0-9][a-zA-Z0-9-]{0,64}(\.[a-zA-Z0-9][a-zA-Z0-9-]{0,25})+$"#

    /// 비밀번호
    ///  - 영문, 숫자 또는 특수문자 총 2가지 조합 +  10~15자 이내
    case password = #"^(?=.*[a-zA-Z])(?=.*[0-9!@#$%&"\'()*+,\-./:;<=>?\\^_`{|}~\[\]])[a-zA-Z0-9!@#$%&"\'()*+,\-./:;<=>?\\^_`{|}~\[\]]{10,15}$"#

    /// 비밀번호
    /// - 영문, 숫자 또는 특수문자 총 2가지 조합
    case passwordCombination = #"^(?=.*[a-zA-Z])(?=.*[0-9!@#$%&"\'()*+,\-./:;<=>?\\^_`{|}~\[\]])[a-zA-Z0-9!@#$%&"\'()*+,\-./:;<=>?\\^_`{|}~\[\]]+$"#

    /// 비밀번호
    /// - 10~15자 이내
    case passwordLength = #"^[\w\S]{10,15}$"#

    case phone = #"^[0-9]{8,25}$"#

    /// 유저 이름
    /// - 한글, 영문 대소문자만 사용 (특수기호, 숫자, 한글의 자음 또는 모음 사용 불가)
    /// - 한글 + 영문 혼용 가능
    /// - 30글자 제한  (공백포함)
    case name = #"^[a-zA-Z가-힣 ]{1,30}$"#

    /// 영어 이름
    case engname = #"^[A-Za-z]+$"#

    /// 여권 이름
    /// - 들어가야함.
    case passportName = #"^[A-Za-z-]+$"#

    /// 여권 번호
    case passportNumber = #"^[a-zA-Z0-9]+$"#

    /// 애플 릴레이
    case applePrivacyEmail = #"^[a-zA-Z0-9._%+-]+@privaterelay\.appleid\.com$"#

    /// 이모지
    case emoji = #"[\\u{1F600}-\\u{1F64F}\\u{1F300}-\\u{1F5FF}\\u{1F680}-\\u{1F6FF}\\u{1F700}-\\u{1F77F}\\u{1F780}-\\u{1F7FF}\\u{1F800}-\\u{1F8FF}\\u{1F900}-\\u{1F9FF}\\u{1FA00}-\\u{1FA6F}\\u{1FA70}-\\u{1FAFF}\\u{2600}-\\u{26FF}\\u{2700}-\\u{27BF}\\u{FE00}-\\u{FE0F}\\u{1F1E6}-\\u{1F1FF}\\u{1F201}-\\u{1F251}\\u{1F004}\\u{1F0CF}\\u{1F018}-\\u{1F270}\\u{1F321}-\\u{1F32C}\\u{1F336}\\u{1F37D}\\u{1F396}-\\u{1F397}\\u{1F399}-\\u{1F39B}\\u{1F39E}-\\u{1F3F0}\\u{1F3F3}-\\u{1F3F5}\\u{1F3F7}-\\u{1F4FD}\\u{1F549}-\\u{1F54E}\\u{1F56F}-\\u{1F570}\\u{1F573}-\\u{1F579}\\u{1F587}\\u{1F58A}-\\u{1F58D}\\u{1F590}\\u{1F5A5}\\u{1F5A8}\\u{1F5B1}-\\u{1F5B2}\\u{1F5BC}\\u{1F5C2}-\\u{1F5C4}\\u{1F5D1}-\\u{1F5D3}\\u{1F5DC}-\\u{1F5DE}\\u{1F5E1}\\u{1F5E3}\\u{1F5E8}\\u{1F5EF}\\u{1F5F3}\\u{1F5FA}\\u{E0020}-\\u{E007F}\\u{1F12F}\\u{1F16C}-\\u{1F16F}\\u{1F170}-\\u{1F171}\\u{1F17E}-\\u{1F17F}\\u{1F18E}\\u{1F191}-\\u{1F19A}\\u{1F1AD}-\\u{1F1E5}]"#

    /// 한글만 포함
    case korean = #"^[가-힣]+$"#
}
